{
    "projects": [
        {
            "id": "computerVision",
            "title": "Computer Vision",
            "description": "Computer Vision demostration through project-based work.",
            "logo": "../logos/computer_vision.svg",
            "subtitles": [
                "OpenCV Basics",
                "Image Processing",
                "Video Basics",
                "Object Detection",
                "Deep Learning",
                "Capstone Project"
            ],
            "sections": [
                "A basic introduction to image handling using OpenCV. OpenCV can interface with python but has core functionality in C++, making it fast enough to process real time image data.",
                "An introduction to image visualization and manipulation with techniques including: color mappings, blending and pasting, thresholding, blurring and smoothing, morphological operators, gradients, and histograms.",
                "Introduction on how to open and use saved video files, and pull video feed from camera hardware.",
                "Introduces and explains how to track objects in Python and OpenCV. Contained are instruction for what features the software detects and how the software can detect these features.",
                "Introduction to automated computerized image processing. All deep learning is done within Keras. All models are contained within the .h5 files.",
                "This is a finger counter program. With live video from the camera, a neural network counts the number of fingers being held up in a segment of the image."
            ] 
        },
        {
            "id": "ct",
            "title": "Computed Tomography",
            "description": "CT scanner mathematical simulation with MATLAB.",
            "subtitles": [
                "CT Simulation - Initial Object to Scan",
                "CT Simulation - CT Machine Configuration",
                "CT Simulation - Sinogram - Single View",
                "CT Simulation - Full Sinogram",
                "CT Simulation - Full Simulation",
                "Algebraic Reconstruction Technique",
                "Metal Artifact Reduction",
                "MAR - Creation of Metal Mask",
                "MAR - Results of Removing Metalic Regions",
                "MAR - Interpolation of Missing Information"
            ],
            "sections": [
                "The goal of this project is to demonstrate how a CT Images are created. This is done in 3 subprojects: CT Simulation, The Algebraic Reconstruction Technique, and Metal Artifact Reduction. This project begins with the simulation. Since the machines are expensive, it is easier to being with a CT image and transform it into CT Data, called a sinogram, with software.",
                "As is the case with any simulation, a physical approximation of the machine is needed. This image shows the manin components of a CT machine, the x-ray source, the detectors, and the locations of the beams themselves. In this simulation there are many more beams than pictured, but the overall visual effectively shows what the machine looks like in this simulation.",
                "For any given position of the machine, this is a visualization of the values that the detector read. The higher the value, the more bone or harder material was present.",
                "The individual views can be stacked on top of each other to create a sinogram. Points in real space are represented as sinusoidal waves. Sinograms are simply a collection of sine waves.",
                "This is a full visualization of the process of collecting CT data. The .gif speaks for itself and shows the process of the simulation. THe virtual machine is rotated around the image and simulated detector data is collected.",
                "The reconstruction is handled through 2 loops. The first loop iterates through every view in the CT data. THe second loop creates iterations of these complete view calculation. Another note to be made is that this is a different dataset as the one referred to at the beginning of this page. This is a chest CT. Lastly, there are many processing techniques and entirely other reconstruction methods that are possible. Namely, Fourier Transform is the industry standard. This is where Sinogram Data is transformed into Fourier Data and then computed into image data. I may explore this in another project, but not for the time being.",
                "Metal in CT scans cause problems for how they affect the x-rays. The noise is pictured in this image.",
                "Masks are commonly used in imaging to identify areas of interest. In this case, the metal is a structure of high attenuation. So the idea is to isolate these regions, transform it into sinogram space, and then apply this mask to the sinogram and reconstruct.",
                "The results of the masked sinogram and masked reconstruction is pictured here. The metal data is gone, but so is much of the other relevant data. So more must be done.",
                "A simple interpolation algorithm is performed on the sinogram data using the mask called regionfill(). This is an internal function within MATLAB and worked very well to showcase how this method works. There was another method shown in my git repo."
            ]
        },
        {
            "title": "ECG Device",
            "description": "Design, Development, and Construction of a electrocardiogram device.",
            "logo": "",
            "subtitles": [
            ],
            "sections": [         
            ] 
        },
        {
            "title": "ISP Optimization",
            "description": "Optimization of an image signal processor using a differentiable proxy.",
            "logo": "",
            "subtitles": [
            ],
            "sections": [         
            ] 
        },
        {
            "title": "Leaf Disease Diagnosis",
            "description": "Agriculture application of deep learning in detecting plant disease.",
            "logo": "",
            "subtitles": [
            ],
            "sections": [         
            ] 
        },
        {
            "title": "Machine-Learned Stethoscope",
            "description": "Medical application of machine learning.",
            "logo": "",
            "subtitles": [
            ],
            "sections": [         
            ] 
        },
        {
            "title": "Morse Code Translator",
            "description": "A simple dictionary-based Morse code translator.",
            "logo": "",
            "subtitles": [
            ],
            "sections": [         
            ] 
        },
        {
            "title": "Nuclear Magnetic Resonance",
            "description": "A digitalization project for a CW-NMR Machine.",
            "logo": "",
            "subtitles": [
            ],
            "sections": [         
            ] 
        }
    ],
    "logos": ["logo1", "logo2", "logo3", "logo4"]
}